--
-- PostgreSQL database dump
--

\restrict VdayFzahQgY8hrcpgU0aBmosLnJpFdEuHyokbCKpJxEaCV1EuXN50TKqDHRpqyM

-- Dumped from database version 14.20 (Ubuntu 14.20-0ubuntu0.22.04.1)
-- Dumped by pg_dump version 14.20 (Ubuntu 14.20-0ubuntu0.22.04.1)

SET statement_timeout = 0;
SET lock_timeout = 0;
SET idle_in_transaction_session_timeout = 0;
SET client_encoding = 'UTF8';
SET standard_conforming_strings = on;
SELECT pg_catalog.set_config('search_path', '', false);
SET check_function_bodies = false;
SET xmloption = content;
SET client_min_messages = warning;
SET row_security = off;

ALTER TABLE IF EXISTS ONLY public.products DROP CONSTRAINT IF EXISTS products_pkey;
ALTER TABLE IF EXISTS public.products ALTER COLUMN id DROP DEFAULT;
DROP SEQUENCE IF EXISTS public.products_id_seq;
DROP TABLE IF EXISTS public.products;
SET default_tablespace = '';

SET default_table_access_method = heap;

--
-- Name: products; Type: TABLE; Schema: public; Owner: admin
--

CREATE TABLE public.products (
    id integer NOT NULL,
    product_id character varying(50) NOT NULL,
    name character varying(200) NOT NULL,
    category character varying(100) NOT NULL,
    stock integer NOT NULL,
    expiry_date date NOT NULL,
    base_price numeric(10,2) NOT NULL,
    applied_discount numeric(5,2) DEFAULT 0
);


ALTER TABLE public.products OWNER TO admin;

--
-- Name: products_id_seq; Type: SEQUENCE; Schema: public; Owner: admin
--

CREATE SEQUENCE public.products_id_seq
    AS integer
    START WITH 1
    INCREMENT BY 1
    NO MINVALUE
    NO MAXVALUE
    CACHE 1;


ALTER TABLE public.products_id_seq OWNER TO admin;

--
-- Name: products_id_seq; Type: SEQUENCE OWNED BY; Schema: public; Owner: admin
--

ALTER SEQUENCE public.products_id_seq OWNED BY public.products.id;


--
-- Name: products id; Type: DEFAULT; Schema: public; Owner: admin
--

ALTER TABLE ONLY public.products ALTER COLUMN id SET DEFAULT nextval('public.products_id_seq'::regclass);


--
-- Data for Name: products; Type: TABLE DATA; Schema: public; Owner: admin
--

COPY public.products (id, name, category, stock, expiry_date, base_price, applied_discount) FROM stdin;
1	أبوكاس أرز مزة هندي بسمتي, طويل الحبة, درجة أولى	pantry	1	2026-12-15	22.00	0.00
2	أبوكاس أرز مزة هندي بسمتي, طويل الحبة, درجة أولى	pantry	22	2027-03-20	14.00	0.00
3	أبوكاس أرز مزة هندي بسمتي, طويل الحبة, درجة أولى	pantry	11	2026-11-05	15.00	0.00
4	الوليمة أرز مزة بسمتي درجة اولى طويل الحبة	pantry	1	2027-01-12	27.00	0.00
5	الوليمة أرز مزة بسمتي حبة طويلة	pantry	30	2026-10-30	14.00	0.00
6	الوليمة أرز مزة بسمتي درجة اولى طويل الحبة	pantry	24	2027-04-18	20.00	0.00
7	عافية زيت ذرة	pantry	0	2026-08-15	18.00	0.00
8	عافية زيت ذرة	pantry	23	2026-09-01	27.00	0.00
9	عافية زيت ّذرة	pantry	14	2026-07-22	45.00	0.00
10	عافية زيت ذرة	pantry	5	2026-12-05	38.00	0.00
11	عافية زيت ذرة	pantry	14	2026-06-14	37.00	0.00
12	عافية زيت دوار الشمس	pantry	1	2026-08-30	38.00	0.00
13	عافية زيت دوار الشمس	pantry	5	2026-05-10	21.00	0.00
14	عافية زيت دوار الشمس	pantry	8	2026-09-12	22.00	0.00
15	عافية زيت دوار الشمس	pantry	5	2026-07-04	30.00	0.00
16	عافية زيت دوارالشمس	pantry	25	2026-10-20	18.00	0.00
17	المراعي حليب طازج كامل الدسم	dairy	11	2025-12-16	7.00	0.00
18	المراعي حليب طازج كامل الدسم	dairy	5	2025-12-18	17.00	0.00
19	المراعي حليب طازج قليل الدسم	dairy	4	2025-12-15	26.00	0.00
20	المراعي حليب طازج قليل الدسم	dairy	43	2025-12-19	28.00	0.00
21	المراعي حليب طازج خالي الدسم	dairy	25	2025-12-17	17.00	0.00
22	المراعي حليب طازج منزوع الدسم جزئياً بنكهة المانجو	dairy	3	2025-12-25	16.00	0.00
23	المراعي حليب بطعم الفراولة منزوع الدسم جزئيا	dairy	36	2025-12-22	22.00	0.00
24	المراعي حليب بطعم الفراولة منزوع الدسم جزئيا	dairy	5	2025-12-23	27.00	0.00
25	المراعي حليب بطعم الشوكولاته منزوع الدسم جزئيا	dairy	19	2025-12-24	12.00	0.00
26	نادك حليب طويل الأجل كامل الدسم	dairy	46	2026-06-01	18.00	0.00
27	نادك حليب طويل الأجل منزوع الدسم	dairy	7	2026-05-15	6.00	0.00
28	نادك حليب طويل الأجل قليل الدسم	dairy	13	2026-05-20	8.00	0.00
29	نادك حليب طازج بالشوكولاتة	dairy	20	2025-12-20	25.00	0.00
30	كابتن نادك حليب طويل الأجل بنكهة الموز	dairy	0	2026-04-10	21.00	0.00
31	كابتن نادك حليب طويل الأجل بنكهة الفانيلا	dairy	25	2026-04-12	23.00	0.00
32	نادك حليب طازج بنكهة المانجو	dairy	0	2025-12-14	28.00	0.00
33	نادك حليب طازج بنكهة الفراولة	dairy	0	2025-12-14	23.00	0.00
34	نادك حليب طازج كامل الدسم	dairy	21	2025-12-16	26.00	0.00
35	نادك حليب طازج كامل الدسم	dairy	49	2025-12-18	30.00	0.00
36	الصافي دانون حليب طويل الأجل منزوع الدسم	dairy	2	2026-05-05	15.00	0.00
37	الصافي دانون حليب طازج كامل الدسم	dairy	9	2025-12-17	17.00	0.00
38	الصافي دانون حليب طازج كامل الدسم	dairy	43	2025-12-19	8.00	0.00
39	الصافي دانون حليب طويل الاجل بنكهة الموز	dairy	14	2026-04-15	16.00	0.00
40	الصافي دانون حليب بنكهة الشوكولاتة طويل الأجل قليل الدسم	dairy	21	2026-04-18	10.00	0.00
41	المراعي لبنة طازجة كاملة الدسم	dairy	15	2026-01-05	18.00	0.00
42	المراعي لبنة طازجة قليلة الدسم	dairy	4	2026-01-07	27.00	0.00
43	المراعي لبن طازج كامل الدسم	dairy	29	2025-12-28	29.00	0.00
44	المراعي لبن طازج كامل الدسم	dairy	8	2025-12-30	26.00	0.00
45	المراعي لبن طازج كامل الدسم	dairy	15	2026-01-02	11.00	0.00
46	الصافي دانون مشروب اللبن بالخوخ والمشمش	dairy	6	2026-01-10	18.00	0.00
47	الصافي دانون لبن	dairy	38	2026-01-08	15.00	0.00
48	الصافي دانون لبن	dairy	30	2026-01-09	7.00	0.00
49	الصافي دانون لبن قليل الدسم	dairy	1	2026-01-06	10.00	0.00
50	الصافي دانون لبن قليل الدسم	dairy	9	2026-01-07	9.00	0.00
51	الصافي دانون لبن طازج قليل الدسم	dairy	31	2025-12-25	26.00	0.00
52	الصافي دانون لبن طازج قليل الدسم	dairy	10	2025-12-27	13.00	0.00
53	الصافي دانون لبن طازج كامل الدسم	dairy	27	2025-12-29	29.00	0.00
54	الصافي دانون زبادي مخفوق بالمانجو	dairy	49	2026-01-15	12.00	0.00
55	الصافي دانون زبادي مخفوق بالفراولة	dairy	26	2026-01-14	24.00	0.00
56	الصافي دانون زبادي مخفوق سادة	dairy	5	2026-01-12	24.00	0.00
57	الصافي دانون زبادي طازج قليل الدسم	dairy	47	2025-12-31	10.00	0.00
58	الصافي دانون زبادي مخفوق بنكهة الفراولة	dairy	34	2026-01-16	8.00	0.00
59	الصافي دانون زبادي مخفوق بنكهة التوت	dairy	49	2026-01-17	25.00	0.00
60	المراعي زبادي طازج كامل الدسم	dairy	17	2025-12-24	7.00	0.00
61	المراعي زبادي طازج قليل الدسم	dairy	8	2025-12-26	20.00	0.00
62	المراعي زبادي طازج قليل الدسم	dairy	50	2025-12-27	25.00	0.00
63	المراعي زبادي بطبقة الفراولة منزوع الدسم جزئيا ومحلى	dairy	20	2026-01-05	9.00	0.00
64	نادك جبنة كريم قابلة للدهن	dairy	3	2026-03-01	7.00	0.00
65	نادك جبنة كريم قابلة للدهن	dairy	37	2026-03-05	16.00	0.00
66	نادك جبنة شيدر قابلة للدهن	dairy	22	2026-04-10	13.00	0.00
67	نادك جبنة شيدر قابلة للدهن	dairy	41	2026-04-12	10.00	0.00
68	نادك جبنة فيتا بيضاء ملح أقل	dairy	18	2026-02-20	15.00	0.00
69	نادك فيتا جبنة بيضاء كاملة الدسم	dairy	3	2026-02-18	13.00	0.00
70	نادك فيتا جبنة بيضاء قليلة الدسم	dairy	32	2026-02-25	28.00	0.00
71	نادك شرائح جبنة شيدر	dairy	25	2026-03-15	16.00	0.00
72	نادك شرائح جبنة قليلة الدسم	dairy	1	2026-03-20	19.00	0.00
73	نادك جبنة مثلثات	dairy	33	2026-06-01	7.00	0.00
74	المراعي زبدة غير مملحة	dairy	25	2026-04-05	17.00	0.00
75	المراعي زبدة غير مملحة	dairy	3	2026-04-02	22.00	0.00
76	المراعي زبدة غير مملحة	dairy	2	2026-04-06	26.00	0.00
77	المراعي زبدة مملحة	dairy	41	2026-04-10	28.00	0.00
78	المراعي زبدة طبيعية. زبدة اللاكتيك غير مملحة	dairy	17	2026-04-01	15.00	0.00
79	لوزين فطيرة الجبنة	bakery	2	2025-12-13	5.00	0.00
80	لوزين فطيرة الفراولة	bakery	9	2025-12-14	12.00	0.00
81	لوزين كرواسان ساده	bakery	35	2025-12-12	18.00	0.00
82	لوزين كرواسان الزعتر والجبنة	bakery	38	2025-12-13	19.00	0.00
83	لوزين بسكويت الكريمة بالفانيلا	bakery	0	2026-02-10	9.00	0.00
84	لوزين ويفر الشوكولاته	bakery	29	2026-03-05	7.00	0.00
85	لوزين ميني معمول	bakery	27	2026-01-20	11.00	0.00
86	لوزين كوب كيك فراولة	bakery	1	2025-12-18	7.00	0.00
87	لوزين كوب كيك توفي	bakery	46	2025-12-19	19.00	0.00
88	لوزين كوب كيك ساده	bakery	44	2025-12-16	3.00	0.00
89	لوزين كوب كيك فراولة	bakery	3	2025-12-18	18.00	0.00
90	لوزين خبز التوست المتكامل	bakery	34	2025-12-12	7.00	0.00
91	لوزين ويفر فراولة	bakery	20	2026-03-12	8.00	0.00
92	لوزين ويفر مكعبات بندق	bakery	3	2026-03-15	6.00	0.00
93	لوزين خبز عربي أبيض	bakery	9	2025-12-11	15.00	0.00
94	لوزين خبز التوست أبيض	bakery	2	2025-12-13	18.00	0.00
95	لوزين خبز التوست بالحبوب	bakery	35	2025-12-13	18.00	0.00
96	لوزينا ساده	bakery	32	2025-12-20	11.00	0.00
97	لوزين فطيرة التفاح	bakery	27	2025-12-15	8.00	0.00
98	لوزين خبز برجر بالسمسم	bakery	48	2025-12-14	4.00	0.00
99	لوزين فطيرة جبن وزعتر	bakery	3	2025-12-15	7.00	0.00
100	لوزين خبز التوست بّر	bakery	0	2025-12-13	7.00	0.00
101	لوزين سكويرز خبز الساندويتش الأبيض	bakery	25	2025-12-14	16.00	0.00
102	لوزين كرواسان الزعتر	bakery	1	2025-12-12	8.00	0.00
103	لوزين كوب كيك شوكولاتة	bakery	36	2025-12-19	19.00	0.00
104	لوزين كوب كيك كراميل	bakery	5	2025-12-20	18.00	0.00
105	Dr. SCHÄR فتات الخبز خالي من الجلوتين	bakery	38	2026-06-10	10.00	0.00
106	Dr. SCHÄR خبز بون ماتين الحلو	bakery	27	2025-12-18	11.00	0.00
107	Dr. SCHÄR خبز باجيت - خالى من الجلوتين	bakery	7	2025-12-16	7.00	0.00
108	Puratos محسن على شكل بودرة للعجائن المجمدة غير المخمرة و ل	bakery	3	2026-08-01	13.00	0.00
109	الكبير فيلية سمك مغلفة بالخبز	bakery	6	2026-03-25	19.00	0.00
110	DS خبز الفطور	bakery	1	2025-12-15	8.00	0.00
111	PANACHAT خبز فالوش مربع - مجمد	bakery	6	2026-05-15	8.00	0.00
112	PANACHAT خبز صغير – مجمد	bakery	50	2026-05-18	14.00	0.00
113	Circle U Foods خليط البهارات لتصنيع أصابع الخبز	bakery	7	2026-09-01	7.00	0.00
114	KALLO عصيان خبز إيطالية.	bakery	49	2026-04-10	3.00	0.00
115	Dr. SCHÄR خليط الدقيق لعمل الكيك والبسكويت	bakery	13	2026-07-15	17.00	0.00
116	OVALETTE محسن للكيك	bakery	34	2026-08-05	16.00	0.00
117	Puratos قاعدة جاهزة للاستعمال لتحضير كيكة الجبن تشيز كيك ز	bakery	14	2026-05-20	6.00	0.00
118	R&H خليط ريتشكريم لتحضير الكيك	bakery	46	2026-06-01	5.00	0.00
119	Brossard كيك بحشوة الشوكولاتة	bakery	25	2025-12-25	4.00	0.00
120	Majestic Cake Donut Mix خليط كيك الدونت بالفانيلا	bakery	5	2026-06-15	14.00	0.00
121	Dawn خليط الكيك الحمراء المخملية	bakery	2	2026-06-18	16.00	0.00
122	Dolcetto كيك إسفنجي بحشوة المشمش	bakery	9	2025-12-30	4.00	0.00
123	Delcetto كيك إسفنجي بحشوة الكرز	bakery	48	2025-12-29	9.00	0.00
124	storm كيك محشى بصلصة الشوكولاتة ومغطى بالكاكاو	bakery	16	2026-01-10	20.00	0.00
125	Gavottes فطيرة دنتيل مقرمشة بالزبدة	bakery	41	2026-04-15	9.00	0.00
126	ORION فطيرة مغطاة بالشوكولاتة	bakery	3	2026-02-05	17.00	0.00
127	VICENZI فيسنزى فطيرة الأصابع الناعمة	bakery	12	2026-03-01	11.00	0.00
128	100 FOODS فطيرة التفاح بالقرفة	bakery	4	2025-12-28	18.00	0.00
129	لوزين فطيرة التفاح	bakery	1	2025-12-15	6.00	0.00
130	Dr. SCHÄR خليط الدقيق لعمل الكيك والبسكويت	bakery	47	2026-07-10	15.00	0.00
131	Dr. SCHÄR بسكويت فورليني الخالي من الجلوتين	bakery	13	2026-05-15	6.00	0.00
132	Dr. SCHÄR بسكويت سوريسي كوكيز بحشوة كريمة الشوكولاتا – خالي 	bakery	38	2026-05-20	16.00	0.00
133	Dr. SCHÄR بسكويت	bakery	1	2026-04-15	6.00	0.00
134	Dr. SCHÄR بسكويت بتيت - خالي من الجلوتين	bakery	4	2026-05-25	9.00	0.00
135	Dr. SCHÄR بسكويت دايجزتيف بالشوكولاتا	bakery	1	2026-06-05	15.00	0.00
136	نبيل بسكويت بكريمة الفانيليا	bakery	32	2026-05-10	8.00	0.00
137	Kambly بسكويت بالشوكولاتة	bakery	0	2026-04-20	5.00	0.00
138	Kambly بسكويت شوكولاتة محشو بالكريمة	bakery	0	2026-04-25	6.00	0.00
139	kambly بسكويت البف باستري بالزبدة	bakery	3	2026-04-15	19.00	0.00
140	DS شرائح رغيف خـبــز أسمــر	bakery	29	2025-12-14	13.00	0.00
141	Regina ساندويش سلطة الدجاج خبز أسمر	bakery	13	2025-12-11	15.00	0.00
142	Schar خـبــز أسمــر	bakery	13	2025-12-16	5.00	0.00
143	Chateau Blanc خبز أسمر	bakery	1	2025-12-14	11.00	0.00
144	PRLSTINE خلطة خبز أسمر كامل	bakery	19	2026-06-20	12.00	0.00
145	HOVIS دقيق خبز أبيض	bakery	18	2026-09-05	6.00	0.00
146	European Bakers خبز أبيض بولمان	bakery	31	2025-12-15	11.00	0.00
147	Breadcrumbs White MM016 U بقسماط الخبز أبيض إم إم 016 يو	bakery	36	2026-07-01	14.00	0.00
148	Tim Hortons خبز أبيض بانيني	bakery	1	2025-12-13	15.00	0.00
149	Heritage شـرائـح خبــز أبيـض بـالثـــوم مجمد	bakery	15	2026-05-10	5.00	0.00
150	Puratos مزيج كامل من البودرة لانتاج الجنواز والسويسرول وال	bakery	7	2026-08-15	6.00	0.00
151	WOUHA كعكة بالشوكولاته	bakery	6	2025-12-28	13.00	0.00
152	حلو هيل وزعفران كعك تمر	bakery	42	2026-01-15	18.00	0.00
153	Gullon كعكة مغطاة بشكولاتة الحليب مع شرائح الشكولاته السا	bakery	48	2026-04-05	16.00	0.00
154	BRITANNIA كعكة بنكهة الفانيلا	bakery	12	2026-03-20	7.00	0.00
155	Backaldrin خليط شوكولاتة لإنتاج كعكة المفن	bakery	1	2026-07-25	12.00	0.00
156	IKEA غم 70X12Xكعكة الأميرة فرودينجي 3	bakery	1	2025-12-30	10.00	0.00
157	Backaldrin كويك أراب محسن على شكل جل للكعك الإسنفجي	bakery	1	2026-09-10	17.00	0.00
158	Backaldrin اميركانا مفن شوكولاته خليط لإنتاج كعكة المفن	bakery	9	2026-07-28	13.00	0.00
159	CHSCAKE كعك الجبنة بالتوت والشيكولاته	bakery	8	2025-12-22	4.00	0.00
160	Puratos محسن على شكل بودرة للعجائن المجمدة غير المخمرة و ل	bakery	8	2026-08-01	17.00	0.00
161	R&F معجنات البوتاي	bakery	6	2026-01-10	14.00	0.00
162	Felchlin حشوة فاكهة التوت جاهزه للاستخدام (لحشو المعجنات وا	bakery	39	2026-05-15	8.00	0.00
163	delifrance معجنات سينامون, الدنماركية مجمدة, جاهزة للخبز مطل	bakery	0	2026-06-01	19.00	0.00
164	LIMPO حشوة المعجنات الفاكهة توت العليق	bakery	31	2026-04-18	6.00	0.00
165	LIMPO حشوة المعجنات بنكهة الفانيلا	bakery	1	2026-04-22	9.00	0.00
166	IFFCO STAR مارجرين المعجنات	bakery	32	2026-09-05	3.00	0.00
167	BRIDOR (معجنات محشوة بالخضار(خرشوف	bakery	9	2026-03-10	10.00	0.00
168	BRIDOR معجنات محشوة بالخضار	bakery	2	2026-03-12	20.00	0.00
169	Pidy معجنات جاهزة للحشو- ابيريكيــــــــش	bakery	40	2026-05-20	4.00	0.00
170	CARREFOUR. خبز توست طري	bakery	33	2025-12-16	15.00	0.00
171	CARREFOUR خبز توست	bakery	42	2025-12-15	17.00	0.00
172	carrefour خبز توست طري	bakery	3	2025-12-17	7.00	0.00
173	Carrefour خبز توست محمص	bakery	4	2026-03-01	19.00	0.00
174	CARREFOUR خبز توست ساندوتش بالقمح	bakery	7	2025-12-16	9.00	0.00
175	CIOCCOLATITALIANI (خبز توست )المجمدة _Q-0515	bakery	16	2026-05-10	10.00	0.00
176	ORGRAN خبز توست مقرمش بالأرز	bakery	10	2026-04-15	18.00	0.00
177	MELBA خبز توست طبيعي	bakery	4	2025-12-20	19.00	0.00
178	Forsan خبز توست أبيض كبير غير مقطع - مدة الصلاحية ٣ أشهر	bakery	47	2026-03-09	17.00	0.00
179	Forsan خبز توست أسمر كبير	bakery	42	2025-12-18	17.00	0.00
180	BRIDOR كرواسون	bakery	36	2025-12-15	11.00	0.00
181	Fuchsia كرواسون بالشيكولاته	bakery	21	2025-12-16	16.00	0.00
182	Bakehouse كرواسون اللوز	bakery	22	2025-12-17	20.00	0.00
183	Bakehouse كرواسون جامبو من الزبد	bakery	3	2025-12-14	4.00	0.00
184	Bridor كرواسون بالزبيب	bakery	38	2025-12-16	13.00	0.00
185	CALLIPO قطع التونة في زيت الزيتون	canned	4	2027-12-01	12.00	0.00
186	CLASSIC تونة خفيفة مفتتة	canned	3	2027-10-15	5.00	0.00
187	العلالي سلطة الفاصوليا الحمراء بالتونة	canned	33	2027-06-20	6.00	0.00
188	العلالي سلطة الخضار بالتونة	canned	11	2027-06-25	10.00	0.00
189	peep لحم تونة خفيف في زيت دوار الشمس	canned	42	2027-09-10	11.00	0.00
190	FRESHLY زبده فول سوداني بالعسل	specialty	8	2026-12-01	36.00	0.00
191	Farleys مهروس فواكه بسكويت وعسل	specialty	11	2026-06-15	55.00	0.00
192	NESTLE كتل قمح بالبندق والعسل.	specialty	39	2026-09-10	26.00	0.00
193	EMCO اصابع الجوز و العسل	specialty	25	2026-08-05	39.00	0.00
194	نور منت حبات حلوى بطعم النعناع والعسل	specialty	5	2027-01-20	29.00	0.00
195	SABCO دجاج مجمد بدون احشاء	frozen	8	2026-06-09	34.00	0.00
196	SABCO دجاج مجمد بدون احشاء	frozen	8	2026-06-09	42.00	0.00
197	Sabco دجاج مجمد بدون احشاء	frozen	10	2026-06-09	27.00	0.00
198	Sabco دجاج مجمد بدون احشاء	frozen	6	2026-06-09	39.00	0.00
199	Sabco دجاج مجمد بدون احشاء	frozen	0	2026-06-09	45.00	0.00
200	Galina دجاج مجمد بدون احشاء	frozen	29	2026-05-20	47.00	0.00
201	Galina دجاج مجمد بدون احشاء	frozen	3	2026-05-20	30.00	0.00
202	Galina دجاج مجمد بدون احشاء	frozen	38	2026-05-20	27.00	0.00
203	Galina دجاج مجمد بدون احشاء	frozen	0	2026-05-20	38.00	0.00
204	Valesul شاورما دجاج مجمدة	frozen	42	2026-04-15	22.00	0.00
205	الكرامة عجينة بيتزا مجمدة حجم كبير (لإعادة تصنيعها )	frozen	24	2026-07-10	33.00	0.00
206	LEPRINO جبنة بيتزا مجمدة مبشورة	frozen	30	2026-03-01	39.00	0.00
207	Kono Pizza -عجينة بيتزا مجمدة - ك س بي اي 144	frozen	43	2026-07-01	39.00	0.00
208	kono Pizza عجينة بيتزا مجمدة – ك س ام أي 198	frozen	14	2026-07-01	33.00	0.00
209	Kono Pizza عجينة بيتزا مجمدة	frozen	19	2026-07-01	21.00	0.00
210	Kono Pizza عجينة بيتزا مجمدة	frozen	0	2026-07-01	19.00	0.00
211	Kono Pizza عجينة بيتزا مجمدة	frozen	4	2026-07-01	49.00	0.00
212	Kono Pizza عجينة بيتزا مجمدة	frozen	20	2026-07-01	24.00	0.00
213	كونو بيتزا عجينة بيتزا مجمدة-ك س يي اي 144	frozen	2	2026-07-01	22.00	0.00
214	Kono Pizza عجينة بيتزا مجمدة -ك اس دبلىو 198	frozen	24	2026-07-01	38.00	0.00
215	خزان سلايدر برجر مجمد	frozen	25	2026-05-15	23.00	0.00
216	هارديز بيف برجر مجمد	frozen	7	2026-05-20	34.00	0.00
217	حلوانى جامبو بيف برجر مجمد	frozen	0	2026-05-25	23.00	0.00
218	EKUR ET ENTRGRE SAN كفتة برجر مجمدة .	frozen	1	2026-04-10	11.00	0.00
219	بيف برجر مجمد هارديز Hardees Frozen Beef Patties	frozen	35	2026-05-20	43.00	0.00
220	اليوم سيقان دجاج - مبرد	frozen	1	2025-12-19	28.00	0.00
221	اليوم أجنحة دجاج - مبرد	frozen	8	2025-12-19	25.00	0.00
222	اليوم أفخاذ دجاج كاملة - مبرد	frozen	3	2025-12-19	38.00	0.00
223	اليوم قوانص دجاج - مبرد	frozen	14	2025-12-19	47.00	0.00
224	اليوم الدجاج المفروم الفاخر - مبرد	frozen	32	2025-12-18	28.00	0.00
225	اليوم أفخاذ دجاج بتتبيلة اللبن والليمون - مبرد	frozen	8	2025-12-17	27.00	0.00
226	اليوم أجنحة دجاج بتتبيلة اللبن والليمون - مبرد	frozen	7	2025-12-17	12.00	0.00
227	اليوم سيقان دجاج بتتبيلة اللبن والليمون - مبرد	frozen	3	2025-12-17	41.00	0.00
228	اليوم أفخاذ دجاج بتتبيلة التشيلي الحارة مبرد	frozen	7	2025-12-17	25.00	0.00
229	اليوم سيقان دجاج بتتبيلة التشيلي الحارة - مبرد	frozen	7	2025-12-17	38.00	0.00
230	اليوم دجاج فاخر طازج - مبرد	frozen	6	2025-12-16	33.00	0.00
231	اليوم دجاج فاخر طازج - مبرد	frozen	21	2025-12-16	39.00	0.00
232	اليوم دجاج فاخر طازج - مبرد	frozen	26	2025-12-16	20.00	0.00
233	اليوم قلوب دجاج - مبرد	frozen	7	2025-12-19	38.00	0.00
234	اليوم أفخاذ دجاج بدون جلد	frozen	37	2026-05-15	11.00	0.00
235	قلوب دجاج اليوم	frozen	0	2026-05-15	14.00	0.00
236	أجنحة دجاج اليوم	frozen	4	2026-05-15	18.00	0.00
237	أفخاذ دجاج اليوم	frozen	15	2026-05-15	13.00	0.00
238	سيقان دجاج اليوم	frozen	1	2026-05-15	15.00	0.00
239	قطع دجاج متنوعة اليوم	frozen	8	2026-05-15	46.00	0.00
240	OTT سمك مجمد (تيوب ) الحبار	frozen	11	2026-08-10	14.00	0.00
241	OTT سمك مجمد بلطي	frozen	31	2026-08-10	37.00	0.00
242	OTT سمك مجمد بايلا	frozen	50	2026-08-10	44.00	0.00
243	Dodo كرات لحم السمك مجمد	frozen	2	2026-07-20	28.00	0.00
244	Dodo كرات لحم السمك مجمد	frozen	5	2026-07-20	41.00	0.00
245	MNS سمك مجمد كاتلا	frozen	9	2026-08-15	30.00	0.00
246	MNS سمك مجمد شرينق	frozen	44	2026-08-15	44.00	0.00
247	quang minh فيليه سمك مجمد	frozen	46	2026-07-25	36.00	0.00
248	OTT سمك مجمد روهو	frozen	32	2026-08-10	20.00	0.00
249	JEDDAH SUPPLIES EST. سمك مجمد كورال	frozen	1	2026-07-30	33.00	0.00
250	BIRDS EYE خضار مجمدة جزر وقرنبيط	frozen	44	2026-09-01	23.00	0.00
251	العريش فطائر خضار مجمدة	frozen	1	2026-06-15	19.00	0.00
252	ALKABEER سمبوسة الخضار مجمدة	frozen	3	2026-06-20	39.00	0.00
253	Boiron بورية خضار مجمدة	frozen	1	2026-08-05	35.00	0.00
254	NOWACO 3أنواع مختلطة خضار مجمدة	frozen	1	2026-08-20	25.00	0.00
255	Prodal بيتزا خضار مجمدة	frozen	20	2026-07-05	23.00	0.00
256	ALKABEER سمبوسة الخضار مجمدة	frozen	11	2026-06-20	43.00	0.00
257	Cream of the Crop خضار مجمدة(جزر, بازلاء , بروكلي , قرنبيط)	frozen	0	2026-08-10	27.00	0.00
258	Alnameer سمبوسة خضار مجمدة	frozen	4	2026-06-25	40.00	0.00
259	AL-NAMEER سبرنج رول خضار مجمدة	frozen	0	2026-06-25	35.00	0.00
260	Ain فراولة مجمدة	frozen	1	2026-07-15	39.00	0.00
261	emborg فراولة مجمدة	frozen	3	2026-07-20	13.00	0.00
262	HALWANI BROS EGYPT فراولة مجمدة	frozen	4	2026-07-25	20.00	0.00
263	PANDA فراولة مجمدة	frozen	3	2026-07-18	18.00	0.00
264	جرين فيلد فراولة مجمدة	frozen	14	2026-07-22	41.00	0.00
265	LAZAH فراولة مجمدة	frozen	14	2026-07-28	25.00	0.00
266	PATAGONIA FOODS فراولة مجمدة	frozen	9	2026-08-01	37.00	0.00
267	MARIETTA فراولة مجمدة	frozen	6	2026-07-15	20.00	0.00
268	Entisar فراولة مجمدة	frozen	5	2026-07-20	12.00	0.00
269	AGA فراولة مجمدة	frozen	20	2026-07-25	34.00	0.00
270	جرين فيلد فواكة مجمدة فراولة	frozen	42	2026-07-22	46.00	0.00
271	LOVE SMOOTHIES فواكة مجمدة (Big 5) (5717)	frozen	10	2026-08-10	38.00	0.00
272	LOVE SMOOTHIES فواكة مجمدة مع النعناع (Coco Loco) (5720)	frozen	33	2026-08-10	32.00	0.00
273	LOVE SMOOTHIES فواكة مجمدة (Melon Refresher) (5712)	frozen	16	2026-08-10	41.00	0.00
274	LOVE SMOOTHIES فواكة مجمدة	frozen	3	2026-08-10	12.00	0.00
275	PRODUCTOF ASUTRALIA قصاصات لحم مجمده خالي من العظم	frozen	6	2026-05-01	29.00	0.00
276	EATCO قطع لحم مجمد	frozen	34	2026-05-05	28.00	0.00
277	LULU كرات اللحم مجمد	frozen	32	2026-05-15	47.00	0.00
278	AL JAZAAR ساق العجل فيل لج لحم مجمد بدون عظم	frozen	17	2026-05-10	34.00	0.00
279	MKR لحم مجمد بدون العظم مختار	frozen	0	2026-05-12	36.00	0.00
280	PURESOUTH قطع لحم مجمدة بالعظم	frozen	35	2026-05-08	27.00	0.00
281	Freshly Frozen Foods شرائح برجر لحم مجمد	frozen	1	2026-04-20	22.00	0.00
282	MLINAR معجنات دائرية صغيرة مع اللحم مجمد	frozen	5	2026-06-05	41.00	0.00
283	AL KABEER لحم مجمد بدون عظم طازج و مجمد لحم جاموس	frozen	3	2026-05-05	30.00	0.00
284	Freshly Frozen Foods فطور نقانق لحم مجمد	frozen	10	2026-04-25	13.00	0.00
285	كوكاكولا لايت	beverages	23	2026-09-15	7.00	0.00
286	كوكاكولا لايت مركزات مشروبات غازية جزء رقم 1	beverages	46	2026-12-01	18.00	0.00
287	كوكاكولا لايت مركزات مشروبات غازية لمشروب لايت كولا جزء رقم 	beverages	2	2026-12-01	13.00	0.00
288	كوكاكولا مشروب غازى	beverages	43	2026-09-15	22.00	0.00
289	كوكاكولا مشروب غازي	beverages	40	2026-09-15	25.00	0.00
290	حدائق الربيع ( خلطة المناقيش )	beverages	1	2026-06-10	15.00	0.00
291	الربيع فول مدمس خلطة سعودية جاهز للتقديم	beverages	24	2027-01-15	5.00	0.00
292	ماجي صلصة أساس مكني	condiments	22	2027-03-10	17.00	0.00
293	ماجيك شرائح مانجو مجمدة	condiments	3	2026-08-05	30.00	0.00
294	ماجيك شيف توابل شواء	condiments	4	2027-09-15	25.00	0.00
295	ماجيك فروله مجمدة	condiments	0	2026-08-10	33.00	0.00
296	ماجيك شرائح مانجو مجمدة	condiments	6	2026-08-05	20.00	0.00
297	ماجيك لب الجوافة المجمد	condiments	42	2026-08-05	31.00	0.00
298	ماجيك فودز فلفل مكسيكي	condiments	1	2026-10-01	15.00	0.00
299	كنور مسحوق شوربة كريمة الدجاج	condiments	9	2027-02-15	6.00	0.00
300	كنور مسحوق مرقة السمك	condiments	39	2027-04-10	18.00	0.00
301	كنور مسحوق مرقة الدجاج	condiments	13	2027-04-10	35.00	0.00
302	كنور مسحوق مرقة الخضروات	condiments	42	2027-04-10	13.00	0.00
303	مياه عذبة مياه شرب معبأة	beverages	50	2027-01-01	20.00	0.00
304	مياه عذبة مياه شرب معبأة	beverages	0	2027-01-01	5.00	0.00
305	Szentkiralyi مياه معدنية طبيعية	beverages	36	2027-02-01	16.00	0.00
306	Szentkiralyi مياه معدنية طبيعية	beverages	31	2027-02-01	25.00	0.00
307	سما مياه معدنية طبيعية	beverages	7	2027-01-15	20.00	0.00
308	نوفا مياه شرب معبأه	beverages	3	2027-03-01	10.00	0.00
309	نوفا مياه شرب معبأه	beverages	26	2027-03-01	13.00	0.00
310	نوفا مياه شرب معبأه	beverages	19	2027-03-01	12.00	0.00
311	بيرين مياهآبار جوفيه معالجة بالأوزون	beverages	19	2027-02-15	21.00	0.00
312	بيرين مياه فواره	beverages	9	2027-02-15	10.00	0.00
313	بيرين مياه معالجة بالأوزون (قليل الصوديوم)	beverages	4	2027-02-15	20.00	0.00
314	بيرين مياه شرب معبأة عبوة بلاستيكية 330 مل	beverages	20	2027-02-15	21.00	0.00
315	بيرين مياه شرب معبأة عبوة بلاستيكية 600 مل	beverages	2	2027-02-15	9.00	0.00
316	صفا مياه شرب معبأة	beverages	3	2027-01-20	12.00	0.00
317	صفا مياه شرب معبأة	beverages	36	2027-01-20	11.00	0.00
318	الصفا زيت حار مصرى	beverages	3	2026-09-01	25.00	0.00
319	الصفا سمن غنم طبيعي	beverages	1	2027-06-01	9.00	0.00
320	نستله حليب مجفف كامل الدسم	beverages	2	2026-10-01	11.00	0.00
321	نستله	beverages	0	2026-08-01	10.00	0.00
322	نستله تشكيله من الشوكولاته الغامقه و شوكولاته الحليب مع 	beverages	4	2026-04-15	15.00	0.00
323	نستله نسكافية	beverages	2	2027-03-01	11.00	0.00
324	SIRMA مياه معدنية طبيعية	beverages	12	2027-02-20	25.00	0.00
325	KEROR عصير التوت البري والعنب الفوار	beverages	2	2026-06-15	24.00	0.00
326	FRESHLY عصير ليمون طبيعي ومركز	beverages	0	2026-09-10	13.00	0.00
327	ana eve شراب شعير خالي من الكحول مع عصير الباشن فروت الطبي	beverages	8	2026-05-20	23.00	0.00
328	LOUIS DREYFUS مركز عصير برتقال مجمد	beverages	21	2026-08-01	8.00	0.00
329	RIBENA عصير التفاح	beverages	4	2026-07-01	5.00	0.00
330	Galaxy Hazelnut شوكولاتة بالحليب ناعمة وغنية مع البندق	snacks	0	2026-09-01	11.00	0.00
331	Galaxy Smooth Milk Minis شوكولاتة بالحليب ناعمة وغنية	snacks	2	2026-09-05	3.00	0.00
332	Galaxy Smooth Milk Minis شوكولاتة بالحليب ناعمة و غنية	snacks	1	2026-09-05	7.00	0.00
333	Galaxy Caramel شوكولاتة بالحليب ناعمة و غنية محشوة بالكراميل	snacks	9	2026-08-20	12.00	0.00
334	Galaxy Caramel Minis شوكولاتة بالحليب ناعمة و غنية محشوة بال	snacks	14	2026-08-20	4.00	0.00
335	لوزين كوب كيك ساده	snacks	4	2025-12-16	13.00	0.00
336	لوزين كوب كيك شوكولاته	snacks	6	2025-12-19	13.00	0.00
337	لوزين كوب كيك تفاح وقرفة	snacks	5	2025-12-15	11.00	0.00
338	لوزين كوب كيك توفي	snacks	17	2025-12-19	14.00	0.00
339	لوزين كوب كيك شوكولاته	snacks	22	2025-12-19	4.00	0.00
340	Godiva Chocolatier شوكولاتة بونبون ( تشكيلة منوعة من الشوكول	snacks	47	2026-06-01	10.00	0.00
341	Godiva Chocolatier ﺷوكولاتة غامقة بنسبة 50 %	snacks	12	2026-10-01	15.00	0.00
342	Godiva Chocolatier شوكولاتة بار ميلك برالاين نوجاتين ( شوكول	snacks	4	2026-06-15	14.00	0.00
343	Godiva Chocolatier شوكولاتة غامقة بتوت ﺍﻟﻌﻟﻳﻕ	snacks	0	2026-06-20	9.00	0.00
344	Godiva Chocolatier علبة بسكويت دارك ﺗﺭوفل هارت ( بسكويت بالش	snacks	9	2026-05-15	13.00	0.00
345	Godiva Chocolatier علبة بسكويت هازلنوت برالين ( بسكويت بالشو	snacks	17	2026-05-15	13.00	0.00
346	Godiva Chocolatier علبةشوﻜﻮﻻتة كاريه بالحليب ( عدد 36 قطعة )	snacks	4	2026-09-10	10.00	0.00
347	Godiva Chocolatier علبة شوكولاتة كاريه غامقة بنسبة 72 % (عدد	snacks	34	2026-09-10	14.00	0.00
348	Godiva Chocolatier علبة ﺷﻭﻛﻭﻻتة كاريه مشكلة من الشوكولاتة ال	snacks	4	2026-09-10	14.00	0.00
349	Godiva Chocolatier بسكويت تروفل ( بسكويت بالشوكولاتة و قشدة 	snacks	6	2026-05-15	14.00	0.00
\.


--
-- Name: products_id_seq; Type: SEQUENCE SET; Schema: public; Owner: admin
--

SELECT pg_catalog.setval('public.products_id_seq', 349, true);


--
-- Name: products products_pkey; Type: CONSTRAINT; Schema: public; Owner: admin
--

ALTER TABLE ONLY public.products
    ADD CONSTRAINT products_pkey PRIMARY KEY (id);


--
-- PostgreSQL database dump complete
--

\unrestrict VdayFzahQgY8hrcpgU0aBmosLnJpFdEuHyokbCKpJxEaCV1EuXN50TKqDHRpqyM

